Music_proj/app/models/user.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "muja@noodleboys.com"], ["LIMIT", 1]]
---
    def self.find_user_by_credentials(email, password)
        user = User.find_by(email: email)

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "[FILTERED]"], ["updated_at", "2023-11-29 19:33:47.058076"], ["id", 1]]
---
    def reset_session_token! #login
        self.session_token = SecureRandom::urlsafe_base64
        self.save!