Music_proj/app/controllers/bands_controller.rb

SELECT "bands".* FROM "bands"
---
    def index
        @bands = Band.all

SELECT "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @band = Band.find(params[:id])