Music_proj/app/controllers/sessions_controller.rb

    def create
        @user = User.find_user_by_credentials(params[:user][:email], params[:user][:password])
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "muja@noodleboys.com"], ["LIMIT", 1]]